#Использовать asserts
#Использовать ".."

Процедура ПередЗапускомТеста() Экспорт

КонецПроцедуры

 
Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьРаботуПолученияОднойЗависимости() Экспорт

    ОписаниеПакета = ПолучитьОписаниеПакета();
    
    Зависимость = ОписаниеПакета.Зависимость("1testrunner");
    Ожидаем.Что(
		Зависимость.ИмяПакета,
        "Ожидаем, имя зависимости пакета ""1testrunner"""
    ).Равно("1testrunner");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьРаботуПолученияЗависимостей() Экспорт

    ОписаниеПакета = ПолучитьОписаниеПакета();
    
    Зависимости = ОписаниеПакета.Зависимости();
    Ожидаем.Что(
		Зависимости.Количество(),
        "Ожидаем, Количество полученных строк равно 2"
    ).Равно(2);

    ЗависимостьТестраннер = Зависимости.Найти("1testrunner");
    Ожидаем.Что(
		ЗависимостьТестраннер,
        "Ожидаем, что есть зависимость от 1testrunner"
    ).Заполнено();

    Ожидаем.Что(
		ЗависимостьТестраннер.ДляРазработки,
        "Ожидаем, зависимость 1testrunner и она для разработки"
    ).Равно(Истина);

    Ожидаем.Что(
		ЗависимостьТестраннер.МинимальнаяВерсия,
        "Ожидаем, зависимость 1testrunner и что указана минимальная версия ""1.0"""
    ).Равно("1.0");

    Ожидаем.Что(
		ЗависимостьТестраннер.МаксимальнаяВерсия,
        "Ожидаем, зависимость 1testrunner и что указана Максимальная версия ""2.0"""
    ).Равно("2.0");
КонецПроцедуры


Функция ПолучитьОписаниеПакета(ПутьКМанифесту = "")
    Если Не ЗначениеЗаполнено(ПутьКМанифесту) Тогда
        ПутьКМанифесту = ОбъединитьПути(ТекущийСценарий().Каталог, "testdata", "testpackage"); 
    КонецЕсли;
    
	Возврат Новый ИнформацияОПакете(ПутьКМанифесту);
КонецФункции