#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
    ВсеТесты = Новый Массив;    
    ВсеТесты.Добавить("ТестДолжен_ПроверитьРаботуПолученияОднойЗависимости");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРаботуПолученияЗависимостей");
    Возврат ВсеТесты;
КонецФункции

Процедура ПередЗапускомТеста() Экспорт

КонецПроцедуры

 
Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРаботуПолученияОднойЗависимости() Экспорт

	ПутьКМанифесту = ОбъединитьПути(ТекущийСценарий().Каталог, "testdata", "testpackage");

	ОписаниеПакета = Новый ИнформацияОПакете(ПутьКМанифесту);
    
    Зависимость = ОписаниеПакета.Зависимость("1testrunner");
    Ожидаем.Что(
		Зависимость.ИмяПакета,
        "Ожидаем, имя зависимости пакета ""1testrunner"""
    ).Равно("1testrunner");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРаботуПолученияЗависимостей() Экспорт

	ПутьКМанифесту = ОбъединитьПути(ТекущийСценарий().Каталог, "testdata", "testpackage");

	ОписаниеПакета = Новый ИнформацияОПакете(ПутьКМанифесту);
    Зависимости = ОписаниеПакета.Зависимости();
    Ожидаем.Что(
		Зависимости.Количество(),
        "Ожидаем, Количество полученных строк равно 2"
    ).Равно(2);

    Ожидаем.Что(
		Зависимости[0].ДляРазработки,
        "Ожидаем, в первой строке будет зависимость для разработки"
    ).Равно(Истина);

КонецПроцедуры

//TODO: Покрыть тестами