#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
    ВсеТесты = Новый Массив;    
    ВсеТесты.Добавить("ТестДолжен_ПроверитьРаботуВыводаВерсииПриложения");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРаботуВыводаАвтораПриложения");
    Возврат ВсеТесты;
КонецФункции

Процедура ПередЗапускомТеста() Экспорт

КонецПроцедуры

 
Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРаботуВыводаВерсииПриложения() Экспорт

	ПутьКМанифесту = ОбъединитьПути(ТекущийСценарий().Каталог, "testdata", "testpackage");

	ОписаниеПакета = Новый ИнформацияОПакете(ПутьКМанифесту);
    
    Ожидаем.Что(
		ОписаниеПакета.Версия(),
        "Ожидаем, версия пакета ""1.0"""
    ).Равно("1.0");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРаботуВыводаАвтораПриложения() Экспорт

	ПутьКМанифесту = ОбъединитьПути(ТекущийСценарий().Каталог, "testdata", "testpackage");

	ОписаниеПакета = Новый ИнформацияОПакете(ПутьКМанифесту);
    
    Ожидаем.Что(
		ОписаниеПакета.Автор(),
        "Ожидаем, автор пакета ""Egor ivanov"""
    ).Равно("Egor ivanov");

КонецПроцедуры

//TODO: Покрыть тестами