#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
    ВсеТесты = Новый Массив;    
    ВсеТесты.Добавить("ТестДолжен_ПроверитьРаботуВключаемыхФайлов");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРаботуИсполняемыхФайлов");
    Возврат ВсеТесты;
КонецФункции

Процедура ПередЗапускомТеста() Экспорт

КонецПроцедуры

 
Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРаботуВключаемыхФайлов() Экспорт

    ОписаниеПакета = ПолучитьОписаниеПакета();
    
    ВключаемыеФайлы = ОписаниеПакета.ВключаемыеФайлы();
    Ожидаем.Что(
		ВключаемыеФайлы,
        "Ожидаем, ВключаемыеФайлы имеет тип массив"
    ).ИмеетТип("Массив");

    Ожидаем.Что(
		ВключаемыеФайлы.Количество(),
        "Ожидаем, ВключаемыеФайлы состоит из 4х элементов"
    ).Равно(4);

    Ожидаем.Что(
        ВключаемыеФайлы.Найти("src"),
        "Ожидаем, ВключаемыеФайлы содержит в себе элемент ""src"""
    ).Не_().Равно(Неопределено);


КонецПроцедуры

Процедура ТестДолжен_ПроверитьРаботуИсполняемыхФайлов() Экспорт

    ОписаниеПакета = ПолучитьОписаниеПакета();
    
    ИсполняемыеФайлы = ОписаниеПакета.ИсполняемыеФайлы();

    Ожидаем.Что(
		ИсполняемыеФайлы,
        "Ожидаем, ИсполняемыеФайлы имеет тип ТаблицаЗначений"
    ).ИмеетТип("ТаблицаЗначений");

    Ожидаем.Что(
		ИсполняемыеФайлы.Количество(),
        "Ожидаем, что количество строк Больше 0"
    ).Больше(0);

    YetAnotherTestName = ИсполняемыеФайлы.Найти("YetAnotherTestName");
    Ожидаем.Что(
		YetAnotherTestName.ИмяПриложения,
        "Ожидаем, что есть строка с именем приложения ""YetAnotherTestName"""
    ).Равно("YetAnotherTestName");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРаботуПолученияВсеМодулиПакета() Экспорт
    
    ОписаниеПакета = ПолучитьОписаниеПакета();

    ВсеМодулиПакета = ОписаниеПакета.ВсеМодулиПакета();
    Ожидаем.Что(
		ВсеМодулиПакета.Количество(),
        "Ожидаем, Количество полученных строк равно 2"
    ).Равно(2);

    Ожидаем.Что(
		ВсеМодулиПакета.Найти("ТестовыйКласс").Идентификатор,
        "Ожидаем, что есть класс с именем ""ТестовыйКласс"""
    ).Равно("ТестовыйКласс");

    Ожидаем.Что(
		ВсеМодулиПакета.Найти("ТестовыйМодуль").Идентификатор,
        "Ожидаем, что есть модуль с именем ""ТестовыйМодуль"""
    ).Равно("ТестовыйМодуль");

КонецПроцедуры

Функция ПолучитьОписаниеПакета(ПутьКМанифесту = "")
    Если Не ЗначениеЗаполнено(ПутьКМанифесту) Тогда
        ПутьКМанифесту = ОбъединитьПути(ТекущийСценарий().Каталог, "testdata", "testpackage"); 
    КонецЕсли;
    
	Возврат Новый ИнформацияОПакете(ПутьКМанифесту);
КонецФункции